# GetCableBreaksCnt

## Description
Get the count of cable breaks in the cable.

```pascal
FUNCTION GetCableBreaksCnt(hObj : HANDLE) : INTEGER;
```

```python

def vs.GetCableBreaksCnt(hObj):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObj|HANDLE||

## Version
Availability: from Vectorworks 2025.4
## Category
* Objects - Cables